MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32U5A9NJ/mcu.h
/************* Bit definition for HSPI_DCR3 register  *************************/
#define HSPI_DCR3_CSBOUND_Pos            XSPI_DCR3_CSBOUND_Pos
#define HSPI_DCR3_CSBOUND_Msk            XSPI_DCR3_CSBOUND_Msk                            /*!< 0x001F0000 */
#define HSPI_DCR3_CSBOUND                XSPI_DCR3_CSBOUND                                /*!< Maximum transfer */

/************* Bit definition for HSPI_DCR4 register  *************************/
#define HSPI_DCR4_REFRESH_Pos            XSPI_DCR4_REFRESH_Pos
#define HSPI_DCR4_REFRESH_Msk            XSPI_DCR4_REFRESH_Msk                            /*!< 0xFFFFFFFF */
#define HSPI_DCR4_REFRESH                XSPI_DCR4_REFRESH                                /*!< Refresh rate */

/************* Bit definition for HSPI_SR register  ***************************/
#define HSPI_SR_TEF_Pos                  XSPI_SR_TEF_Pos
#define HSPI_SR_TEF_Msk                  XSPI_SR_TEF_Msk                                  /*!< 0x00000001 */
#define HSPI_SR_TEF                      XSPI_SR_TEF                                      /*!< Transfer Error Flag */
#define HSPI_SR_TCF_Pos                  XSPI_SR_TCF_Pos
#define HSPI_SR_TCF_Msk                  XSPI_SR_TCF_Msk                                  /*!< 0x00000002 */
#define HSPI_SR_TCF                      XSPI_SR_TCF                                      /*!< Transfer Complete Flag */
#define HSPI_SR_FTF_Pos                  XSPI_SR_FTF_Pos
#define HSPI_SR_FTF_Msk                  XSPI_SR_FTF_Msk                                  /*!< 0x00000004 */
#define HSPI_SR_FTF                      XSPI_SR_FTF                                      /*!< FIFO Threshold Flag */
#define HSPI_SR_SMF_Pos                  XSPI_SR_SMF_Pos
#define HSPI_SR_SMF_Msk                  XSPI_SR_SMF_Msk                                  /*!< 0x00000008 */
#define HSPI_SR_SMF                      XSPI_SR_SMF                                      /*!< Status Match Flag */
#define HSPI_SR_TOF_Pos                  XSPI_SR_TOF_Pos
#define HSPI_SR_TOF_Msk                  XSPI_SR_TOF_Msk                                  /*!< 0x00000010 */
#define HSPI_SR_TOF                      XSPI_SR_TOF                                      /*!< Timeout Flag */
#define HSPI_SR_BUSY_Pos                 XSPI_SR_BUSY_Pos
#define HSPI_SR_BUSY_Msk                 XSPI_SR_BUSY_Msk                                 /*!< 0x00000020 */
#define HSPI_SR_BUSY                     XSPI_SR_BUSY                                     /*!< Busy */
#define HSPI_SR_FLEVEL_Pos               XSPI_SR_FLEVEL_Pos
#define HSPI_SR_FLEVEL_Msk               XSPI_SR_FLEVEL_Msk                               /*!< 0x00007F00 */
#define HSPI_SR_FLEVEL                   XSPI_SR_FLEVEL                                   /*!< FIFO Level */

/************* Bit definition for HSPI_FCR register  *************************/
#define HSPI_FCR_CTEF_Pos                XSPI_FCR_CTEF_Pos
#define HSPI_FCR_CTEF_Msk                XSPI_FCR_CTEF_Msk                                /*!< 0x00000001 */
#define HSPI_FCR_CTEF                    XSPI_FCR_CTEF                                    /*!< Clear Transfer Error Flag */
#define HSPI_FCR_CTCF_Pos                XSPI_FCR_CTCF_Pos
#define HSPI_FCR_CTCF_Msk                XSPI_FCR_CTCF_Msk                                /*!< 0x00000002 */
#define HSPI_FCR_CTCF                    XSPI_FCR_CTCF                                    /*!< Clear Transfer Complete Flag */
#define HSPI_FCR_CSMF_Pos                XSPI_FCR_CSMF_Pos
#define HSPI_FCR_CSMF_Msk                XSPI_FCR_CSMF_Msk                                /*!< 0x00000008 */
#define HSPI_FCR_CSMF                    XSPI_FCR_CSMF                                    /*!< Clear Status Match Flag */
#define HSPI_FCR_CTOF_Pos                XSPI_FCR_CTOF_Pos
#define HSPI_FCR_CTOF_Msk                XSPI_FCR_CTOF_Msk                                /*!< 0x00000010 */
#define HSPI_FCR_CTOF                    XSPI_FCR_CTOF                                    /*!< Clear Timeout Flag */

/************* Bit definition for HSPI_DLR register  *************************/
#define HSPI_DLR_DL_Pos                  XSPI_DLR_DL_Pos
#define HSPI_DLR_DL_Msk                  XSPI_DLR_DL_Msk                                  /*!< 0xFFFFFFFF */
#define HSPI_DLR_DL                      XSPI_DLR_DL                                      /*!< Data Length */

/************* Bit definition for HSPI_AR register  *************************/
#define HSPI_AR_ADDRESS_Pos              XSPI_AR_ADDRESS_Pos
#define HSPI_AR_ADDRESS_Msk              XSPI_AR_ADDRESS_Msk                              /*!< 0xFFFFFFFF */
#define HSPI_AR_ADDRESS                  XSPI_AR_ADDRESS                                  /*!< Address */

/************* Bit definition for HSPI_DR register  *************************/
#define HSPI_DR_DATA_Pos                 XSPI_DR_DATA_Pos
#define HSPI_DR_DATA_Msk                 XSPI_DR_DATA_Msk                                 /*!< 0xFFFFFFFF */
#define HSPI_DR_DATA                     XSPI_DR_DATA                                     /*!< Data */

/************ Bit definition for HSPI_PSMKR register  ***********************/
#define HSPI_PSMKR_MASK_Pos              XSPI_PSMKR_MASK_Pos
#define HSPI_PSMKR_MASK_Msk              XSPI_PSMKR_MASK_Msk                              /*!< 0xFFFFFFFF */
#define HSPI_PSMKR_MASK                  XSPI_PSMKR_MASK                                  /*!< Status mask */

/************ Bit definition for HSPI_PSMAR register  ***********************/
#define HSPI_PSMAR_MATCH_Pos             XSPI_PSMAR_MATCH_Pos
#define HSPI_PSMAR_MATCH_Msk             XSPI_PSMAR_MATCH_Msk                             /*!< 0xFFFFFFFF */
#define HSPI_PSMAR_MATCH                 XSPI_PSMAR_MATCH                                 /*!< Status match */

/************* Bit definition for HSPI_PIR register  ************************/
#define HSPI_PIR_INTERVAL_Pos            XSPI_PIR_INTERVAL_Pos
#define HSPI_PIR_INTERVAL_Msk            XSPI_PIR_INTERVAL_Msk                            /*!< 0x0000FFFF */
#define HSPI_PIR_INTERVAL                XSPI_PIR_INTERVAL                                /*!< Polling Interval */

/************* Bit definition for HSPI_CCR register  ************************/
#define HSPI_CCR_IMODE_Pos               XSPI_CCR_IMODE_Pos
#define HSPI_CCR_IMODE_Msk               XSPI_CCR_IMODE_Msk                               /*!< 0x00000007 */
#define HSPI_CCR_IMODE                   XSPI_CCR_IMODE                                   /*!< Instruction Mode */
#define HSPI_CCR_IMODE_0                 XSPI_CCR_IMODE_0                                 /*!< 0x00000001 */
#define HSPI_CCR_IMODE_1                 XSPI_CCR_IMODE_1                                 /*!< 0x00000002 */
#define HSPI_CCR_IMODE_2                 XSPI_CCR_IMODE_2                                 /*!< 0x00000004 */
#define HSPI_CCR_IDTR_Pos                XSPI_CCR_IDTR_Pos
#define HSPI_CCR_IDTR_Msk                XSPI_CCR_IDTR_Msk                                /*!< 0x00000008 */
#define HSPI_CCR_IDTR                    XSPI_CCR_IDTR                                    /*!< Instruction Double Transfer Rate */
#define HSPI_CCR_ISIZE_Pos               XSPI_CCR_ISIZE_Pos
#define HSPI_CCR_ISIZE_Msk               XSPI_CCR_ISIZE_Msk                               /*!< 0x00000030 */
#define HSPI_CCR_ISIZE                   XSPI_CCR_ISIZE                                   /*!< Instruction Size */
#define HSPI_CCR_ISIZE_0                 XSPI_CCR_ISIZE_0                                 /*!< 0x00000010 */
#define HSPI_CCR_ISIZE_1                 XSPI_CCR_ISIZE_1                                 /*!< 0x00000020 */
#define HSPI_CCR_ADMODE_Pos              XSPI_CCR_ADMODE_Pos
#define HSPI_CCR_ADMODE_Msk              XSPI_CCR_ADMODE_Msk                              /*!< 0x00000700 */
#define HSPI_CCR_ADMODE                  XSPI_CCR_ADMODE                                  /*!< Address Mode */
#define HSPI_CCR_ADMODE_0                XSPI_CCR_ADMODE_0                                /*!< 0x00000100 */
#define HSPI_CCR_ADMODE_1                XSPI_CCR_ADMODE_1                                /*!< 0x00000200 */
#define HSPI_CCR_ADMODE_2                XSPI_CCR_ADMODE_2                                /*!< 0x00000400 */
#define HSPI_CCR_ADDTR_Pos               XSPI_CCR_ADDTR_Pos
#define HSPI_CCR_ADDTR_Msk               XSPI_CCR_ADDTR_Msk                               /*!< 0x00000800 */
#define HSPI_CCR_ADDTR                   XSPI_CCR_ADDTR                                   /*!< Address Double Transfer Rate */
#define HSPI_CCR_ADSIZE_Pos              XSPI_CCR_ADSIZE_Pos
#define HSPI_CCR_ADSIZE_Msk              XSPI_CCR_ADSIZE_Msk                              /*!< 0x00003000 */
#define HSPI_CCR_ADSIZE                  XSPI_CCR_ADSIZE                                  /*!< Address Size */
#define HSPI_CCR_ADSIZE_0                XSPI_CCR_ADSIZE_0                                /*!< 0x00001000 */
#define HSPI_CCR_ADSIZE_1                XSPI_CCR_ADSIZE_1                                /*!< 0x00002000 */
#define HSPI_CCR_ABMODE_Pos              XSPI_CCR_ABMODE_Pos
#define HSPI_CCR_ABMODE_Msk              XSPI_CCR_ABMODE_Msk                              /*!< 0x00070000 */
#define HSPI_CCR_ABMODE                  XSPI_CCR_ABMODE                                  /*!< Alternate Bytes Mode */
#define HSPI_CCR_ABMODE_0                XSPI_CCR_ABMODE_0                                /*!< 0x00010000 */
#define HSPI_CCR_ABMODE_1                XSPI_CCR_ABMODE_1                                /*!< 0x00020000 */
#define HSPI_CCR_ABMODE_2                XSPI_CCR_ABMODE_2                                /*!< 0x00040000 */
#define HSPI_CCR_ABDTR_Pos               XSPI_CCR_ABDTR_Pos
#define HSPI_CCR_ABDTR_Msk               XSPI_CCR_ABDTR_Msk                               /*!< 0x00080000 */
#define HSPI_CCR_ABDTR                   XSPI_CCR_ABDTR                                   /*!< Alternate Bytes Double Transfer Rate */
#define HSPI_CCR_ABSIZE_Pos              XSPI_CCR_ABSIZE_Pos
#define HSPI_CCR_ABSIZE_Msk              XSPI_CCR_ABSIZE_Msk                              /*!< 0x00300000 */
#define HSPI_CCR_ABSIZE                  XSPI_CCR_ABSIZE                                  /*!< Alternate Bytes Size */
#define HSPI_CCR_ABSIZE_0                XSPI_CCR_ABSIZE_0                                /*!< 0x00100000 */
#define HSPI_CCR_ABSIZE_1                XSPI_CCR_ABSIZE_1                                /*!< 0x00200000 */
#define HSPI_CCR_DMODE_Pos               XSPI_CCR_DMODE_Pos
#define HSPI_CCR_DMODE_Msk               XSPI_CCR_DMODE_Msk                               /*!< 0x07000000 */
#define HSPI_CCR_DMODE                   XSPI_CCR_DMODE                                   /*!< Data Mode */
#define HSPI_CCR_DMODE_0                 XSPI_CCR_DMODE_0                                 /*!< 0x01000000 */
#define HSPI_CCR_DMODE_1                 XSPI_CCR_DMODE_1                                 /*!< 0x02000000 */
#define HSPI_CCR_DMODE_2                 XSPI_CCR_DMODE_2                                 /*!< 0x04000000 */
#define HSPI_CCR_DDTR_Pos                XSPI_CCR_DDTR_Pos
#define HSPI_CCR_DDTR_Msk                XSPI_CCR_DDTR_Msk                                /*!< 0x08000000 */
#define HSPI_CCR_DDTR                    XSPI_CCR_DDTR                                    /*!< Data Double Transfer Rate */
#define HSPI_CCR_DQSE_Pos                XSPI_CCR_DQSE_Pos
#define HSPI_CCR_DQSE_Msk                XSPI_CCR_DQSE_Msk                                /*!< 0x20000000 */
#define HSPI_CCR_DQSE                    XSPI_CCR_DQSE                                    /*!< DQS Enable */
#define HSPI_CCR_SIOO_Pos                XSPI_CCR_SIOO_Pos
#define HSPI_CCR_SIOO_Msk                XSPI_CCR_SIOO_Msk                                /*!< 0x80000000 */
#define HSPI_CCR_SIOO                    XSPI_CCR_SIOO                                    /*!< Send Instruction Only Once Mode */

/************* Bit definition for HSPI_TCR register  *************************/
#define HSPI_TCR_DCYC_Pos                XSPI_TCR_DCYC_Pos
#define HSPI_TCR_DCYC_Msk                XSPI_TCR_DCYC_Msk                                /*!< 0x0000001F */
#define HSPI_TCR_DCYC                    XSPI_TCR_DCYC                                    /*!< Number of Dummy Cycles */
#define HSPI_TCR_DHQC_Pos                XSPI_TCR_DHQC_Pos
#define HSPI_TCR_DHQC_Msk                XSPI_TCR_DHQC_Msk                                /*!< 0x10000000 */
#define HSPI_TCR_DHQC                    XSPI_TCR_DHQC                                    /*!< Delay Hold Quarter Cycle */
#define HSPI_TCR_SSHIFT_Pos              XSPI_TCR_SSHIFT_Pos
#define HSPI_TCR_SSHIFT_Msk              XSPI_TCR_SSHIFT_Msk                              /*!< 0x40000000 */
#define HSPI_TCR_SSHIFT                  XSPI_TCR_SSHIFT                                  /*!< Sample Shift */

/************* Bit definition for HSPI_IR register  **************************/
#define HSPI_IR_INSTRUCTION_Pos          XSPI_IR_INSTRUCTION_Pos
#define HSPI_IR_INSTRUCTION_Msk          XSPI_IR_INSTRUCTION_Msk                          /*!< 0xFFFFFFFF */
#define HSPI_IR_INSTRUCTION              XSPI_IR_INSTRUCTION                              /*!< Instruction */

